In [1]:
a={
    "id":[1,2,3,4,5],
    "Name" : ["Sam","Garvit","Rahul","Mayank","Kriti"],
    "Department":["IT","IT","HR","Operating","IT"],
    "Working_hours": [8,9,8,8,9],
    "Salary":[34000,23000,40000,45000,50000]
}

In [2]:
# Pandas=> open-source library ==> Data Manipulation

# Data Structures :
# 1. Series ==> 1D ==> Only values
# 2. DataFrame ==> Multi-Dimensional => Values with column name

In [3]:
import pandas as pd

In [4]:
df=pd.DataFrame(a)
df

   id    Name Department  Working_hours  Salary
0   1     Sam         IT              8   34000
1   2  Garvit         IT              9   23000
2   3   Rahul         HR              8   40000
3   4  Mayank  Operating              8   45000
4   5   Kriti         IT              9   50000

# How can we get top data?

In [5]:
df.head()

   id    Name Department  Working_hours  Salary
0   1     Sam         IT              8   34000
1   2  Garvit         IT              9   23000
2   3   Rahul         HR              8   40000
3   4  Mayank  Operating              8   45000
4   5   Kriti         IT              9   50000

In [6]:
df.head(3)

   id    Name Department  Working_hours  Salary
0   1     Sam         IT              8   34000
1   2  Garvit         IT              9   23000
2   3   Rahul         HR              8   40000

# How can we get bottom data?

In [7]:
df.tail()

   id    Name Department  Working_hours  Salary
0   1     Sam         IT              8   34000
1   2  Garvit         IT              9   23000
2   3   Rahul         HR              8   40000
3   4  Mayank  Operating              8   45000
4   5   Kriti         IT              9   50000

In [8]:
df.tail(2)

   id    Name Department  Working_hours  Salary
3   4  Mayank  Operating              8   45000
4   5   Kriti         IT              9   50000

# Random Indexed Data

In [9]:
df.sample(4)

   id    Name Department  Working_hours  Salary
1   2  Garvit         IT              9   23000
2   3   Rahul         HR              8   40000
4   5   Kriti         IT              9   50000
3   4  Mayank  Operating              8   45000

In [10]:
df.info() # A complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             5 non-null      int64
 1   Name           5 non-null      object
 2   Department     5 non-null      object
 3   Working_hours  5 non-null      int64
 4   Salary         5 non-null      int64
dtypes: int64(3), object(2)
memory usage: 328.0+ bytes

In [11]:
df.describe() # Statically view of data

             id  Working_hours        Salary
count  5.000000       5.000000      5.000000
mean   3.000000       8.400000  38400.000000
std    1.581139       0.547723  10454.664031
min    1.000000       8.000000  23000.000000
25%    2.000000       8.000000  34000.000000
50%    3.000000       8.000000  40000.000000
75%    4.000000       9.000000  45000.000000
max    5.000000       9.000000  50000.000000

In [12]:
df.columns

Index(['id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')

In [13]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')]

In [14]:

# Loc and iloc ==> data extraction
# df.loc[row_range,column_name] ==> slicing ==> starting and last value include
# df.loc[row_range,column_range] ==> slicing ==> starting value include and last value exclude

In [15]:
df.loc[:2,['id','Salary']]

   id  Salary
0   1   34000
1   2   23000
2   3   40000

In [16]:
import pandas as pd

# Creating a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df = pd.DataFrame(data)

# Using loc to select data
selected_data = df.loc[:3, ['Name','Age']]
print(selected_data)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

#  How to get CSV file

In [19]:
df=pd.read_csv("C:\\Users\\91636\\OneDrive\\Desktop\\Regex ML\\Data\\covid_toy.csv")

In [20]:
df.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [21]:
df.to_csv("C:\\Users\\91636\\OneDrive\\Desktop\\Regex ML\\Data\\covid_toy.csv", index=False)

In [22]:
# Value_counts()==> total of sub-categories in a category

In [23]:
df['gender'].value_counts()

Female    59
Male      41
Name: gender, dtype: int64

In [24]:
df['cough'].value_counts()

Mild      62
Strong    38
Name: cough, dtype: int64

In [25]:
a={
    "id":[1,2,3,4,5],
    "Name" : ["Sam","Garvit","Rahul","Mayank","Kriti"],
    "Department":["IT","IT","HR","Operating","IT"],
    "Working_hours": [8,9,8,8,9],
    "Salary":[34000,23000,40000,45000,50000]
}

In [26]:
df=pd.DataFrame(a)
df

   id    Name Department  Working_hours  Salary
0   1     Sam         IT              8   34000
1   2  Garvit         IT              9   23000
2   3   Rahul         HR              8   40000
3   4  Mayank  Operating              8   45000
4   5   Kriti         IT              9   50000

In [27]:
df.sort_values(by='Salary')

   id    Name Department  Working_hours  Salary
1   2  Garvit         IT              9   23000
0   1     Sam         IT              8   34000
2   3   Rahul         HR              8   40000
3   4  Mayank  Operating              8   45000
4   5   Kriti         IT              9   50000

In [28]:
df.sort_index()

   id    Name Department  Working_hours  Salary
0   1     Sam         IT              8   34000
1   2  Garvit         IT              9   23000
2   3   Rahul         HR              8   40000
3   4  Mayank  Operating              8   45000
4   5   Kriti         IT              9   50000

In [29]:
df['Salary'].astype(float) # We can change data type of elements

0    34000.0
1    23000.0
2    40000.0
3    45000.0
4    50000.0
Name: Salary, dtype: float64

In [30]:
df['Salary'].astype(int)

0    34000
1    23000
2    40000
3    45000
4    50000
Name: Salary, dtype: int32

In [31]:
df['Salary'].add(1000)

0    35000
1    24000
2    41000
3    46000
4    51000
Name: Salary, dtype: int64

In [32]:
df.count()

id               5
Name             5
Department       5
Working_hours    5
Salary           5
dtype: int64

In [33]:
df.min()

id                    1
Name             Garvit
Department           HR
Working_hours         8
Salary            23000
dtype: object

In [34]:
df.max()

id                       5
Name                   Sam
Department       Operating
Working_hours            9
Salary               50000
dtype: object

In [35]:
df

   id    Name Department  Working_hours  Salary
0   1     Sam         IT              8   34000
1   2  Garvit         IT              9   23000
2   3   Rahul         HR              8   40000
3   4  Mayank  Operating              8   45000
4   5   Kriti         IT              9   50000

In [36]:
df.filter(items = ['Name','Dapartment','Salary'])

     Name  Salary
0     Sam   34000
1  Garvit   23000
2   Rahul   40000
3  Mayank   45000
4   Kriti   50000

In [37]:
df[['Name','Department']]

     Name Department
0     Sam         IT
1  Garvit         IT
2   Rahul         HR
3  Mayank  Operating
4   Kriti         IT

In [38]:
df.filter(items=[2,3],axis=0)

   id    Name Department  Working_hours  Salary
2   3   Rahul         HR              8   40000
3   4  Mayank  Operating              8   45000

In [39]:
df.to_dict() # Save data into dictionary

{'id': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5},
 'Name': {0: 'Sam', 1: 'Garvit', 2: 'Rahul', 3: 'Mayank', 4: 'Kriti'},
 'Department': {0: 'IT', 1: 'IT', 2: 'HR', 3: 'Operating', 4: 'IT'},
 'Working_hours': {0: 8, 1: 9, 2: 8, 3: 8, 4: 9},
 'Salary': {0: 34000, 1: 23000, 2: 40000, 3: 45000, 4: 50000}}

In [40]:
df.to_string() # save data into string

'   id    Name Department  Working_hours  Salary\n0   1     Sam         IT              8   34000\n1   2  Garvit         IT              9   23000\n2   3   Rahul         HR              8   40000\n3   4  Mayank  Operating              8   45000\n4   5   Kriti         IT              9   50000'

In [41]:
df.columns[0:3] # Starting column labels

Index(['id', 'Name', 'Department'], dtype='object')

In [42]:
df.columns.tolist() # list of column labels

['id', 'Name', 'Department', 'Working_hours', 'Salary']

In [43]:
df.columns.values # arr of column labels

array(['id', 'Name', 'Department', 'Working_hours', 'Salary'],
      dtype=object)

In [44]:
df.rename(columns={'Name':'Updated_Name',
                  'Salary': 'Updated_Salary'})

   id Updated_Name Department  Working_hours  Updated_Salary
0   1          Sam         IT              8           34000
1   2       Garvit         IT              9           23000
2   3        Rahul         HR              8           40000
3   4       Mayank  Operating              8           45000
4   5        Kriti         IT              9           50000

In [45]:
df['New_Salary_Record']=df['Salary'].where(df['Salary']>=40000, other=0)

In [46]:
df

   id    Name Department  Working_hours  Salary  New_Salary_Record
0   1     Sam         IT              8   34000                  0
1   2  Garvit         IT              9   23000                  0
2   3   Rahul         HR              8   40000              40000
3   4  Mayank  Operating              8   45000              45000
4   5   Kriti         IT              9   50000              50000

In [47]:
import pandas as pd

In [48]:
df = pd.read_csv("C:\\Users\\91636\\OneDrive\\Desktop\\Regex ML\\Data\\titanic.csv")

In [49]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [50]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [51]:
df['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64